---
kind: method
id: M:Autodesk.Revit.DB.FamilySizeTableColumn.Dispose
source: html/628cb83f-99b6-fcaf-16f8-28e7e3fd9cbb.htm
---
# Autodesk.Revit.DB.FamilySizeTableColumn.Dispose Method

Releases all resources used by the FamilySizeTableColumn

## Syntax (C#)
```csharp
public void Dispose()
```